---
kind: enumMember
id: F:Autodesk.Revit.DB.TessellatedBuildIssueType.TooShortOriginalLoopGeomSegment
enum: Autodesk.Revit.DB.TessellatedBuildIssueType
source: html/b9f37bb0-1c2b-0fe9-a4e8-5a49d2b9b7ac.htm
---
# Autodesk.Revit.DB.TessellatedBuildIssueType.TooShortOriginalLoopGeomSegment

A face loop, containing a segment which is too short for a geometry,
 but not for a mesh.
 Associated numbers are face, loop and point indices respectively
 (the segment goes from the previous point to this one).